[
  {
    "title": "App Review - Distribute - Apple Developer",
    "url": "https://developer.apple.com/distribute/app-review/",
    "html": "App Review\n\nWe review all apps, app updates, app bundles, in-app purchases, and in-app events submitted to App Store Connect to help provide a safe and trusted experience for users and the opportunity for developers to succeed. As you plan and build, use these guidelines and resources to help the review process go as smoothly as possible.\n\nPreparing for review\nSubmitting for review\nAvoiding common issues\nContacting us\nPreparing for review\n\nLearn about the guidelines your submission needs to follow and information you’ll provide for review.\n\nGuidelines\n\nGet in-depth details on the technical, content, and design criteria that we use for review, and learn about other key guidelines.\n\nApp Review Guidelines\nHuman Interface Design Guidelines\nGuidelines for Using Apple Trademarks and Copyrights\nApple Developer Program License Agreement\n\nThe Apple Developer Program License Agreement details your obligations and responsibilities for the use of Apple software and services. The latest agreement can be found on the Agreements and Guidelines page.\n\nRead the latest license agreement\n\nAlternative Terms Addendum for Apps in the EU\n\nTo distribute your app from an alternative app marketplace or use alternative payment options on the App Store in the European Union, you'll need to review and sign an addendum to the Apple Developer Program License Agreement.\n\nApp review information\n\nIf your app requires specific settings, user account information, or special instructions, include these details in the App Review Information section of App Store Connect. If you don’t include this information, the app review process may be delayed and your app may not pass review.\n\nFor more details, view App Store Connect Help.\n\nSubmitting for review\n\nWhen you submit for review in App Store Connect, you can:\n\nManage your submissions and communicate with App Review on the App Review page within My Apps. You can visit the App Review page at any time, even if you don’t have active submissions or conversations.\nSubmit items such as in-app events, custom product pages, and product page optimization tests without needing a new app version.\nInclude multiple items in one submission.\nRemove items with issues from your submission and continue with items that were accepted by App Review.\nView a history of submissions created using the updated experience, including messages from App Review.\nDecide whether your app is reviewed for the App Store or Notarization only.\nReview status\n\nOn average, 90% of submissions are reviewed in less than 24 hours. You’ll be notified by email of status changes. You can also check the review status of your submission in the My Apps section of App Store Connect or on the App Store Connect app for iPhone and iPad. If your submission is incomplete, review times may be delayed or your submission may not pass.\n\nFor status details, view App Store Connect Help.\n\nAvoiding common issues\n\nWe’ve highlighted some of the most common issues to help you better prepare before submitting for review. On average, over 40% of unresolved issues are related to guideline 2.1: App Completeness, which covers crashes, placeholder content, incomplete information, and more.\n\nWatch “Tips for preventing common review issues”\n\nCrashes and bugs\n\nSubmit items for review only when they’re complete and ready to be published. Make sure to thoroughly test on devices running the latest software and fix all bugs before submitting. View guideline 2.1.\n\nBroken links\n\nAll links in your app must be functional. A link to user support with up-to-date contact information and a link to your privacy policy is required for all apps. View guideline 2.1 and guideline 5.1.\n\nPlaceholder content\n\nFinalize all images and text before submitting for review. Items that are still in progress and contain placeholder content are not ready to be distributed and cannot be approved. View guideline 2.1.\n\nIncomplete information\n\nEnter all of the details needed for review in the App Review Information section of App Store Connect. If some features require signing in, provide a valid demo account username and password. If there are special configurations to set, include the specifics. If features require an environment that is hard to replicate or require specific hardware, be prepared to provide a demo video or the hardware. Also, please make sure your contact information is complete and up to date. View guideline 2.1.\n\nSpecific documentation is required for certain scenarios and types of apps. Here are a few examples:\n\nIf the app is for kids and contains third-party ads, provide a link to the ad services’ publicly documented practices and policies for Kids category apps, including human review of ad creatives for age appropriateness. View guideline 1.3.\nIf the app works with medical hardware, provide a copy of regulatory clearance for the locations where the app is available. View guideline 1.4.\nIf the app features third-party trademarks or copyrighted content or lets users stream or download third-party content, provide the authorization to do so. Examples include video streaming and marketing that uses imagery of celebrities, sports, movies, or music. View guideline 4.1 and guideline 5.2.\nIf the app facilitates services requiring licensing, such as real money gaming and gambling, lotteries, raffles, and VPN licensing, provide the authorization to do so. Note that licensing requirements may vary depending on region. View guideline 5.\nPrivacy policy issues\n\nMake sure your privacy policy adheres to guideline 5.1 and:\n\nIdentifies the data the app collects, how it collects that data, and all uses of that data.\nConfirms that any third party with whom the app shares user data provides the same or equal protection of user data as stated in the app’s privacy policy.\nExplains your data retention and deletion policies and describes how a user can revoke consent and/or request deletion of their data.\nUnclear data access requests\n\nWhen requesting permission to access user or usage data, you should clearly and completely describe how your app will use the data. Including an example can help users understand why your app is requesting access to their personal information. View guideline 5.1.\n\nIf your app’s code references one or more APIs that access sensitive user data, the app’s Info.plist file should contain a $!{infoPlistKey} key with a user-facing purpose string explaining clearly and completely why your app needs the data. All apps submitted to App Store Connect that access user data are required to include a purpose string.\n\nLearn about requesting permission\n\nInaccurate screenshots\n\nScreenshots should accurately communicate value and functionality. Use text and overlay images to highlight the user experience, not obscure it. Make sure your UI and product images match the corresponding device type in App Store Connect. View guideline 2.3.\n\n \nSubstandard user interface\n\nApple places a high value on clean, refined, and user-friendly interfaces. Make sure your UI meets these requirements by planning your design carefully and following our design guides and UI Design Dos and Don’ts.\n\n \nWeb clippings, content aggregators, or a collection of links\n\nYour app should be engaging and useful, and make the most of the features unique to iOS. Websites served in an iOS app, web content that is not formatted for iOS, and limited web interactions do not make a quality app. View guideline 4.2.\n\nRepeated submission of similar apps\n\nSubmitting several apps that are essentially the same ties up the App Review process and risks your apps not passing review. Improve your review experience — and the experience of your future users — by thoughtfully combining your apps into one. View guideline 4.3.\n\nMisleading users\n\nYour app must perform as advertised and should not give users the impression the app is something it is not. If your app appears to promise certain features and functionalities, it needs to deliver. View guideline 2.3.\n\nNot enough lasting value\n\nIf your app doesn’t offer much functionality or content, or only applies to a small niche market, it may not be approved. Before creating your app, take a look at the apps in your category on the App Store and consider how you can provide an even better user experience. View guideline 4.2.\n\nSubmitted by incorrect entity\n\nCertain types of apps must be submitted by the legal entity that provides the services rather than an individual developer. These apps include, but are not limited to, those that require sensitive user information or provide services in highly regulated fields, such as banking and financial services, cryptocurrency, healthcare, gambling, and air travel. If you need to provide partnership documentation or authorization, attach the files in the Attachment section in App Store Connect and provide any descriptions or links in the Review Notes field. View guideline 3 and guideline 5.1.1.\n\nTechnical Support\n\nIf your app didn’t pass review for technical reasons, such as crashes or bugs, view the following documentation:\n\nAcquiring Crash Reports and Diagnostic Logs\nAnalyzing a Crash Report\nIdentifying the Cause of Common Crashes\n\nYou can also visit the Apple Developer Forums or request code-level support.\n\nContacting us\nApp Review submissions\n\nYou can view your past and current submissions to App Review in App Store Connect. If your submission didn’t pass review, details are provided, including any specific App Review Guidelines that your submission didn’t follow. You can correspond with App Review to resolve the issues before resubmitting the build. Access the App Review section on the app’s page in App Store Connect.\n\nLearn about corresponding with App Review\n\nAppeals\n\nIf your app didn’t pass review and you feel we misunderstood your app’s concept and functionality, or that you were treated unfairly by Apple in the course of our review, you may choose to submit an appeal to the App Review Board. If you file an appeal, make sure to:\n\nProvide specific reasons why you believe your app complies with the App Review Guidelines.\nSubmit only one appeal per submission that didn’t pass review.\nRespond to any requests for additional information before submitting an appeal.\n\nSubmit an appeal\n\nExpedited reviews\n\nYou can request the review of your app to be expedited if you face extenuating circumstances, such as fixing a critical bug in your app or releasing your app to coincide with an event you’re directly associated with. Expedited reviews are granted on a limited basis and we cannot guarantee that every request will be expedited.\n\nCritical bug fix. When submitting an expedited review to fix a critical bug, include the steps to reproduce the bug on the current version of your app.\n\nEvent-related app. For apps associated with an event, we recommend you plan and schedule the release of your app in App Store Connect. However, if your app is still in review and the launch of your event is quickly approaching, you can request to have your app review expedited. Make sure your request includes the event, date of the event, and your app’s association with the event.\n\nRequest an expedited review\n\nBug fix submissions\n\nIf you’re submitting a bug fix update for your app and we find additional issues during review, you have the option to resolve the additional issues with your next submission, as long as there are no legal or safety concerns. To accept, simply reply to the offer message in App Store Connect and indicate you would like the current submission to be approved.\n\nView App Store Connect\n\nSuggestions\n\nHelp improve the App Review Guidelines or identify a need for clarity in our policies by suggesting guideline changes. Your suggestions will be taken into consideration by App Review.\n\nMake a suggestion\n\nReport a concern\n\nIf you believe that an app presents a trust or safety concern, or is in violation of the App Review Guidelines, you can share details with us to investigate.\n\nFile a report\n\nOther questions\n\nYou can contact us to ask for clarification on unresolved issues, provide requested information, report an app, and more.\n\nContact us"
  }
]