[
  {
    "title": "API Overview - App Store Connect - Apple Developer",
    "url": "https://developer.apple.com/app-store-connect/api/",
    "html": "Automate your workflow with the App Store Connect API\n\nCustomize and automate your workflows so you can focus on creating great apps. This standards-based REST API lets you automate tasks across developer tools, such as App Store Connect, Xcode, and Certificates, Identifiers & Profiles, to give you greater flexibility and efficiency in your workflows.\n\nIn-app purchases\n\nManage your in-app purchase metadata, set pricing and availability, submit for review, and delete in-app purchases.\n\nLearn about in-app purchases\n\nSubscriptions\n\nManage your subscription metadata, set pricing and availability, create subscription groups, submit for review, and more.\n\nLearn about subscriptions\n\nGame Center\n\nSet up and manage all your Game Center features, like achievements and leaderboards. Game Center helps motivate your players to engage and helps new players discover your game on the App Store and across their Apple devices.\n\nLearn about Game Center\n\nCustomer reviews\n\nRetrieve customer reviews and manage your responses to customer reviews.\n\nLearn about managing customer reviews\n\nApp management\n\nCreate new versions of your app, set up pre-orders, manage phased releases for version updates, submit your app for review, release approved apps on the App Store, and more.\n\nLearn about managing apps\n\nApp metadata\n\nBuild and maintain your App Store product page by uploading and managing assets, such as your app’s description, screenshots, and previews.\n\nLearn about app metadata\n\nPricing and availability\n\nSet your app’s pricing and territory availability. Access reference information, such as a list of available App Store territories, app price tiers, and proceeds for currencies that the App Store supports.\n\nLearn about pricing and availability\n\nProvisioning\n\nStreamline app development by managing bundle IDs, signing certificates, development devices, and provisioning profiles.\n\nLearn about provisioning\n\nTestFlight\n\nManage beta testing by automating tester management and build distribution. You can add and remove testers, manage internal and external tester groups, assign builds to testers, submit builds to TestFlight App Review, and more.\n\nLearn about TestFlight\n\nUsers and roles\n\nIntegrate your Apple Developer Program membership with your organization’s internal directory to automate tasks associated with team management. For example, you can automatically revoke access to App Store Connect when a user leaves your organization.\n\nLearn about users and roles\n\nApp Clips\n\nSet up default and advanced App Clip experiences. An App Clip is a small part of your app that’s discoverable at the moment it’s needed and lets people start and finish an experience from your app in seconds.\n\nLearn about App Clips\n\nXcode Cloud\n\nCreate and update workflows, start builds, and read Xcode Cloud data to create dashboards or reports that track your continuous integration build status and metrics.\n\nLearn about Xcode Cloud workflows and builds\n\nPower and performance\n\nDownload power and performance metrics and diagnostics logs to monitor app performance indicators, such as launch time, hang rate, hang diagnostics, disk writes, memory use, and battery life. This information is also available in Xcode.\n\nLearn about improving your app’s performance\n\nReporting\n\nGet the data you need to make meaningful decisions and improve your app.\n\nAnalytics\n\nFind out how people use your app on iOS and the App Store through engagement, commerce, usage, framework, and performance data.\n\nLearn about Analytics\n\nSales and Trends\n\nGain insight into your app’s sales, subscriptions, first-time downloads, pre-orders, proceeds and more.\n\nLearn about Sales and Trends\n\nPayments and Financial Reports\n\nView details about your app’s earnings, withholdings, and taxes by product, territory, currency, and price.\n\nLearn about Payments and Financial Reports"
  },
  {
    "title": "App Analytics - App Store Connect - Apple Developer",
    "url": "https://developer.apple.com/app-store-connect/analytics/",
    "html": "Watch “Discover Benchmarks in App Analytics” from WWDC22\n\nGain insights with analytics\n\nMeasure your app’s performance and get unique insights with data you won’t find anywhere else using App Analytics, Sales and Trends, and Payments and Financial Reports. Available in App Store Connect, these tools are included with Apple Developer Program membership and require no technical implementation.\n\nApp Analytics Sales and Trends Payments and Financial Reports\nApp Analytics\n\nFind out how people discover and engage with your app.\n\nApp Store performance\n\nSee how many people discover your app while searching or browsing on the App Store, and find out which apps and websites bring people to your product page. You can measure your app’s downloads, including First-Time Downloads, Redownloads, and Total Downloads, as well as your App Store conversion rate. This data provides insight into how your marketing efforts and metadata changes affect downloads.\n\nMarketing campaigns\n\nMeasure the performance of your marketing campaigns across channels, such as social media, email, and paid advertising, so you can focus on the campaigns that are most effective. Measure downloads from Smart App Banners in Safari and cross-promotion in apps that use StoreKit to display your product page. Create unique links for each marketing campaign, so you’ll understand your average spend per user and know which campaigns drive the most downloads.\n\nApp Clip performance\n\nUnderstand how people discover and engage with your App Clip, so you can measure performance over time. Find out which sources they used to invoke it (for example, NFC tags, Safari, or App Clip Codes) and see the number of App Clip card views, installations, sessions, crashes, and more. You can also view the number of resulting app installations.\n\nIn-app event performance\n\nView information about your in-app events, including event page views, reminder and notification data, and the number of downloads and redownloads that were driven by your in-app events. Each metric can be viewed by territory, source type, device, and more, so you can understand how your in-app events are influencing the growth and success of your apps.\n\nApp engagement and usage\n\nMeasure a variety of user engagement metrics, find out if people continue to use your app, and view the number of installations, sessions, and active devices. This information allows you to evaluate the impact of product changes, such as adjustments to the onboarding experience or the addition of special in-app content. View crash and deletion data by platform, app version, and operating system version to pinpoint potential causes and create a better user experience.\n\nPaying users\n\nView the number of unique paying users by day, week, or month. The daily number of unique paying users can help you assess whether changes you make impact user spending within your app. Filter sales per paying users by source to learn the average spend per user from a particular campaign, app, or website.\n\nPre-orders\n\nFind out how many users have pre-ordered your app before it’s available for download on the App Store. The Overview page shows the number of pre-orders, and breaks them down by territory, source type, and more.\n\nPeer group benchmarksNew\n\nPut your app’s performance into context using peer group benchmarks, which compare your app’s performance to that of similar apps on the App Store. Peer group benchmarks provide powerful new insights across the customer journey, enabling you to identify what works well in your app and what can be improved. Apps are placed into groups based on their App Store category, business model, and download volume to ensure relevant comparisons. Using industry-leading differential privacy techniques, peer group benchmarks provide relevant and actionable insights — all while keeping the performance of individual apps private.\n\nSales and Trends\n\nGet daily data to understand your app’s performance and forecast your sales. Download reports with additional data to conduct deeper analysis.\n\nSubscription activity\n\nView the number of active paid subscribers, subscribers that continue renewing, subscribers that convert to a standard price from each type of subscription offer, and more. See how many new customers subscribe each day, as well as daily subscription sales, reasons a subscription has been cancelled (including billing issues and price increases), and more. You can also filter this data by app, subscription, and other metrics to analyze performance.\n\nBusiness performance\n\nView data for downloads of your apps, initiated sales, initiated pre-orders, and estimated proceeds. You can also filter data by date ranges, transaction types, subscription offerings, territories, and other metrics.\n\nPayments and financial reports\n\nView your final proceeds for each month, with earnings broken out by territory and currency. See the rates used to convert your earnings from local currencies (when available) and any taxes and adjustments applied. You can also download more detailed reports of all transactions, including the number of units sold per app or in-app purchase, for the month.\n\nDocumentation and help\n\nGet details, including definitions for metrics and dimensions in each tool.\n\nApp Store Connect Help: Analytics and reporting overview\nApple Developer Forums: Analytics & Reporting"
  },
  {
    "title": "App Store Connect - Apple Developer",
    "url": "https://developer.apple.com/app-store-connect/",
    "html": "Your apps on the App Store\n\nAs an Apple Developer Program member, you can easily upload, submit, and manage your apps on the App Store with App Store Connect on the web, iPhone, and iPad. This suite of tools also lets you view sales reports, access app analytics, invite users to test your apps with TestFlight, and much more.\n\nManage your apps\nCreate your product page\n\nHelp customers find and engage with your app on the App Store by creating a great product page. You can enter your app name, subtitle, keywords, description, and more, in 40 languages. Upload up to 10 screenshots and three optional app previews for each supported language, and choose the order you’d like them to appear.\n\nYou can make your product page even more relevant and effective for customers on the App Store with product page optimization and custom product pages.\n\nLearn more about product pages\n\nAdd in-app purchases\n\nSell a variety of content, including subscriptions, new features, and services, from within your app by entering in-app purchase details in App Store Connect. You can also select in-app purchases to promote directly on the App Store.\n\nLearn more about in-app purchases\n\nTest your apps\n\nInvite users to test your apps and App Clips and collect valuable feedback before releasing your apps on the App Store using TestFlight in App Store Connect. You can invite up to 10,000 testers using just their email address or by sharing a public link.\n\nLearn more about TestFlight\n\nSubmit\n\nView each build of your app that you’ve uploaded using Xcode or altool. When your app is ready for public distribution, submit it to App Store Review.\n\nLearn about App Store Review\n\nManage releases and updates\n\nPublish your app as soon as it’s approved, or manually release it on a specific day. Choose a price point, offer introductory prices for auto-renewable subscriptions, and even let customers pre-order your iOS or iPadOS app. You can also release iOS and iPadOS app updates in phases over a seven‑day period.\n\nLearn more about publishing your app\n\nGain performance insights\n\nApp Analytics lets you measure user engagement, marketing campaigns, and monetization using data you won’t find anywhere else. Get next-day sales and unit data in Sales and Trends, and view details on completed payments in Payments and Financial Reports.\n\nLearn more about App Analytics\n\nManage agreements and financial information\n\nView and accept the agreements required to offer apps on the App Store. Add your bank account and tax information to receive payments, view invoices, and more.\n\nLearn more about Agreements, Tax, and Banking\n\nAccess additional features\nIn-app events\n\nOffer timely events within your apps and games — such as game competitions, movie premieres, live-streamed experiences, and more — that customers can discover right on the App Store.\n\nLearn more about in-app events\n\nRespond to reviews\n\nRespond to user reviews on your App Store product page to improve your app’s discoverability, encourage downloads, and build rapport.\n\nLearn more about responding to user reviews\n\nPromo codes\n\nCreate and distribute promo codes to give potential customers or press a free download of your app or in-app purchase.\n\nLearn more about promo codes\n\nGame Center\n\nConfigure features to bring even more fun and connection to your games with Game Center, Apple’s social gaming network.\n\nLearn more about Game Center\n\nApp bundles\n\nGroup up to 10 of your apps together into a single download.\n\nLearn more about app bundles\n\nApp Store Connect for iPad and iPhone\n\nThe App Store Connect app lets you monitor your app’s sales and downloads, reply to App Store Review, get notified of new reviews, respond to reviews, and more, all on your iPhone or iPad.\n\nDownload on the App Store\n\nApp Store Connect API\n\nAutomate tasks on App Store Connect and customize key parts of your internal workflow using the App Store Connect REST API for internal development, testing, and reporting purposes within your team.\n\nRequest access to the API\n\nDocumentation and resources\n\nGet details on using App Store Connect and view business and marketing resources.\n\nApp Store Connect Help\nApp Store Business and Marketing Resources\nApp Store Connect Videos"
  }
]